import ein_image from "./images/아인슈타인.png";
import new_image from "./images/뉴턴.png";
import su_image from "./images/슈뢰딩거.png";
import ein_pro_image from "./images/아인슈타인프로필.png";

export const persons = [
  {
    id: 1,
    link: ein_image,
    name: "알버트 아인슈타인",
    nickname: "현대 과학의 아버지",
    info: [
      "특수 상대성 이론과 일반 상대성 이론을 발표하여 현대 물리학의 기초를 세웠습니다.",
      "광전효과에 대한 연구로 노벨 물리학상을 수상했습니다.",
      "그의 업적은 우주와 물질의 이해에 혁명을 가져왔으며, 현대 과학과 기술 발전에 큰 영향을 미쳤습니다.",
    ],
    moreInfo: `은 독일 태생의 이론물리학자입니다.\n\n그는 특수 상대성 이론과 일반 상대성 이론을 발표하여 현대 물리학의 기초를 세웠습니다. 또한, 광전효과에 대한 연구로 노벨 물리학상을 수상했습니다. 그의 업적은 우주와 물질의 이해에 혁명을 가져왔으며, 현대 과학과 기술 발전에 큰 영향을 미쳤습니다.\n\n1905년, 아인슈타인은 빛의 양자 이론, 특수 상대성 이론, 브라운 운동의 이론을 발표했습니다. 이 논문들은 과학계에 큰 반향을 일으켰으며, 아인슈타인을 세계적인 과학자로 만들었습니다.\n\n1915년, 아인슈타인은 일반 상대성 이론을 발표했습니다. 이 이론은 중력이 질량에 의해 발생한다는 것을 주장합니다. 일반 상대성 이론은 우주의 구조를 이해하는 데 큰 도움을 주었으며, 현대 천문학의 기초를 이루고 있습니다.\n\n아인슈타인은 광전효과에 대한 연구로 1921년에 노벨 물리학상을 수상했습니다. 그는 노벨상 수상 연설에서 '우리는 우주의 가장 원초적인 법칙을 이해하지 못하지만, 그 법칙이 존재한다고 믿을 수밖에 없다'고 말했습니다.`,
    disabled: false,
    proImg: ein_pro_image,
  },
  {
    id: 2,
    link: new_image,
    name: "아이작 뉴턴",
    nickname: "근대 과학의 거장",
    info: [
      "만유인력 법칙을 발견하여 고전 역학의 기초를 세웠습니다.",
      "미적분학을 개발하여 수학의 발전에 큰 기여를 했습니다.",
      "광학에 대한 연구로 빛의 성질을 밝혀냈습니다.",
    ],
    disabled: true,
  },
  {
    id: 3,
    link: su_image,
    name: "에르빈 슈뢰딩거",
    nickname: "양자 역학의 아버지",
    info: [
      "양자 역학의 기본 방정식인 슈뢰딩거 방정식을 발표했습니다.",
      "슈뢰딩거의 고양이 사고 실험을 통해 양자 역학의 불확정성 원리를 설명했습니다.",
      "노벨 물리학상을 수상했습니다.",
    ],
    disabled: true,
  },
  { id: 4, info: [], disabled: true },
  { id: 5, info: [], disabled: true },
  { id: 6, info: [], disabled: true },
];
