import ein_image from "./images/아인슈타인.png";
import new_image from "./images/뉴턴.png";
import su_image from "./images/슈뢰딩거.png";
import ein_pro_image from "./images/아인슈타인프로필.png";
import new_pro_image from "./images/뉴턴프로필.png";
import sej_image from "./images/세종대왕.png";
import sej_pro_image from "./images/세종프.png";
import ling_image from "./images/링컨.png";
import ling_pro_image from "./images/링컨프.png";
import napol_image from "./images/나폴레옹.png";

export const persons = [
  [
    {
      id: 0,
      link: sej_image,
      name: "세종대왕",
      nickname: "한글의 창시자",
      info: [
        "한글을 창제하여, 한국인의 독자적인 문화 형성에 기여했습니다.",
        "조선의 과학, 기술 발전에 많은 관심을 기울였고, 다양한 과학 기구를 발명하고, 책을 편찬했습니다.",
        "조선 왕조의 안정화에 기여하여 국가를 견고하게 유지하였습니다.",
      ],
      moreInfo: `은 조선의 4대 임금으로, 1397년 태종과 원경왕후 민씨의 셋째 아들로 태어났습니다. 1418년 즉위하여 32년간 재위했으며, 한글 창제, 훈민정음, 과학 기술 발전, 문화 예술 진흥 등 많은 업적을 남겼습니다.\n\n세종대왕은 한글을 창제하여 백성들의 문맹률을 낮추고, 훈민정음을 통해 백성들이 쉽게 책을 읽고 쓸 수 있도록 했습니다. 또한, 과학 기술 발전을 위해 집현전을 설치하고, 천문학, 지리학, 의학, 수학 등 다양한 분야의 책을 편찬했습니다. 또한, 문화 예술 진흥을 위해 음악, 미술, 연극 등 다양한 분야의 예술을 장려했습니다.\n\n세종대왕은 조선 역사상 가장 위대한 임금 중 한 명으로 평가받고 있으며, 그의 업적은 오늘날에도 우리에게 큰 영향을 미치고 있습니다.`,
      disabled: false,
      proImg: sej_pro_image,
    },
    {
      id: 1,
      link: ling_image,
      name: "아브라함 링컨",
      nickname: "해방의 대통령",
      info: [
        "미국 내 전쟁 상태에서도 노예 해방을 포함한 인간의 평등과 자유를 위해 노력했습니다. ",
        "분열된 미국을 통일하는 데 많은 역할을 했습니다.",
        "미국의 경제 발전과 국가 발전을 위해 제정주의 정책을 추진했습니다.",
      ],
      moreInfo: `은 미국의 역사적인 인물로, 16대 미국 대통령으로 잘 알려져 있습니다. 링컨은 1861년부터 1865년까지 4년 동안 대통령으로 재직하며 미국을 이끌었습니다. 그의 리더십, 민주주의 신념, 인권과 평등에 대한 열정은 많은 사람들에게 영감을 주고 있습니다.\n\n링컨은 미국에서의 노예제도 폐지와 미국 내 분열을 초래한 남북 전쟁의 지도자로 알려져 있습니다. 그는 노예제도의 폐지와 인종 평등을 위해 투쟁했으며, 1863년에 발표한 "해방 선언"으로 미국에서의 노예제도를 폐지하고 인종 간의 평등을 선언했습니다.\n\n링컨은 통일과 국가의 발전을 목표로 하는 미국 제정주의의 추진자로 알려져 있습니다. 그는 미국 내 전쟁 상황에서도 국가의 통일을 위해 노력하고, 경제 발전을 위해 산업화와 철도 건설 등의 정책을 추진했습니다.\n\n링컨은 1865년 4월에 암살당하여 죽었으나, 그의 유산은 미국의 역사와 정치에 큰 영향을 미쳤습니다. 그의 인격과 리더십은 오늘날까지도 많은 사람들에게 영감을 주며, 링컨의 업적과 이념은 미국과 세계의 인권과 자유를 위한 투쟁에 영향을 끼치고 있습니다.
      `,
      disabled: false,
      proImg: ling_pro_image,
    },
    {
      id: 2,
      link: napol_image,
      name: "나폴레옹",
      nickname: "내 사전에 불가능은 없다",
      info: [
        "프랑스 혁명 이후 혼란한 상황을 정리하고 국가를 안정시키기 위해 다양한 제도 개혁을 추진했습니다.",
        "프랑스 제국의 성립과 군사적 확장을 이루었습니다.",
        " 공공 사업을 진행하고 철도 건설을 촉진했으며, 농업 혁신과 무역 정책을 통해 경제 성장을 도모했습니다.",
      ],
      disabled: true,
    },
    { id: 3, info: [], disabled: true },
    { id: 4, info: [], disabled: true },
    { id: 5, info: [], disabled: true },
  ],
  [
    {
      id: 0,
      link: ein_image,
      name: "알버트 아인슈타인",
      nickname: "현대 과학의 아버지",
      info: [
        "특수 상대성 이론과 일반 상대성 이론을 발표하여 현대 물리학의 기초를 세웠습니다.",
        "광전효과에 대한 연구로 노벨 물리학상을 수상했습니다.",
        "그의 업적은 우주와 물질의 이해에 혁명을 가져왔으며, 현대 과학과 기술 발전에 큰 영향을 미쳤습니다.",
      ],
      moreInfo: `은 독일 태생의 이론물리학자입니다.\n\n그는 특수 상대성 이론과 일반 상대성 이론을 발표하여 현대 물리학의 기초를 세웠습니다. 또한, 광전효과에 대한 연구로 노벨 물리학상을 수상했습니다. 그의 업적은 우주와 물질의 이해에 혁명을 가져왔으며, 현대 과학과 기술 발전에 큰 영향을 미쳤습니다.\n\n1905년, 아인슈타인은 빛의 양자 이론, 특수 상대성 이론, 브라운 운동의 이론을 발표했습니다. 이 논문들은 과학계에 큰 반향을 일으켰으며, 아인슈타인을 세계적인 과학자로 만들었습니다.\n\n1915년, 아인슈타인은 일반 상대성 이론을 발표했습니다. 이 이론은 중력이 질량에 의해 발생한다는 것을 주장합니다. 일반 상대성 이론은 우주의 구조를 이해하는 데 큰 도움을 주었으며, 현대 천문학의 기초를 이루고 있습니다.\n\n아인슈타인은 광전효과에 대한 연구로 1921년에 노벨 물리학상을 수상했습니다. 그는 노벨상 수상 연설에서 '우리는 우주의 가장 원초적인 법칙을 이해하지 못하지만, 그 법칙이 존재한다고 믿을 수밖에 없다'고 말했습니다.`,
      disabled: false,
      proImg: ein_pro_image,
    },
    {
      id: 1,
      link: new_image,
      name: "아이작 뉴턴",
      nickname: "근대 과학의 거장",
      info: [
        "만유인력 법칙을 발견하여 고전 역학의 기초를 세웠습니다.",
        "미적분학을 개발하여 수학의 발전에 큰 기여를 했습니다.",
        "광학에 대한 연구로 빛의 성질을 밝혀냈습니다.",
      ],
      disabled: false,
      proImg: new_pro_image,
    },
    {
      id: 2,
      link: su_image,
      name: "에르빈 슈뢰딩거",
      nickname: "양자 역학의 아버지",
      info: [
        "양자 역학의 기본 방정식인 슈뢰딩거 방정식을 발표했습니다.",
        "슈뢰딩거의 고양이 사고 실험을 통해 양자 역학의 불확정성 원리를 설명했습니다.",
        "노벨 물리학상을 수상했습니다.",
      ],
      disabled: true,
    },
    { id: 3, info: [], disabled: true },
    { id: 4, info: [], disabled: true },
    { id: 5, info: [], disabled: true },
  ],
];
